Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExcludeType Property
 Gets or sets the exclusion of first and last bars.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing.ExcludeTypeEnum ExcludeType { get; set; }
Public Property ExcludeType As RebarSpacing.ExcludeTypeEnum
	Get
	Set
Property Value
Type: RebarSpacing.ExcludeTypeEnum
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace